// pages/qicai/qicai.js
Page({
  /**
   * 页面的初始数据
   */
  data: {
    items: [
      {
        "url": "../images/pbj.png",
        "title": "智能跑步机",
        "details":"我们的跑步机在传统的跑步机仪表盘上增加了音乐、视频（电影）、网络视频、Wifi等功能，增强了娱乐功能的跑步机您的跑步过程更加轻松，还可以记录你的健身情况，次数，心率啊等等。"
      },
      {
        "url": "../images/dgdc2.png",
        "title": "动感单车",
        "details": "动感单车运动后会消耗很多的能量，同时还增强你的腿部的力量，美化下肢形体，提高身体摄氧量。网上的实践证明，有效的进行40分钟的动感单车训练，可以消耗500卡左右的热量。"
      },
      {
        "url": "../images/dsj.png",
        "title": "登山机",
        "details": "登山机是一种基于快跑、慢跑于一身的多功能有氧训练。因其运动方式酷似登山运动而得名。使用登山机可以达到较好的减肥效果。"
      },
      {
        "url": "../images/llxlq.png",
        "title": "拉力训练器",
        "details": "跟其他健身器材不同，施加在肌肉上的张力恒定，不会因为手臂的变化而变化，选择不同的位置，可以锻炼到腿部、臂部、背部、胸部、腹部肌肉。"
      },{
        "url": "../images/qtxlq.png",
        "title": "坐式屈腿训练器",
        "details": "练习小腿，大腿肌肉和膝关节的机器。"
      },{
        "url": "../images/gl.png",
        "title": "杠铃",
        "details": "杠铃是一种核心训练运动训练器材，也是举重所用器材。杠铃运动属于重量训练的一种，只是利用杠铃训练器材，来增进肌肉力量的训练。也可以利用杠铃进行核心训练，促进整体的协调性。"
      }, {
        "url": "../images/hdj.png",
        "title": "蝴蝶机",
        "details": "主要锻炼胸大肌为主的胸部诸肌蝴蝶机 蝴蝶机是进行飞鸟夹胸时所使用的一种机械。主要锻炼胸大肌为主的胸部诸肌，初级使用者多会背部紧贴座椅，以便用力；较有经验的用者则会背部离椅，同时锻炼腹部肌肉。"
      }
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})